#include <iostream>
using namespace std;
/*
Задача №2941. Последняя цифра
Дано натуральное число. Выведите его последнюю цифру.

Входные данные
Вводится натуральное число.

Выходные данные
Выведите ответ на задачу.
*/

int main(){

int a;

cin >> a;

cout << (a%10) << endl;

return(0);

}